perf/ping/endurance.yaml
config:
    environments:
      node:
        target: 'http://localhost:5555/node'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
  
    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  
    phases:
      - name: Subida
        duration: 30
        arrivalRate: 20
        rampTo: 200
      - name: Constante
        duration: 200
        arrivalRate: 200
      - name: Reset
        arrivalRate: 1
        duration: 20

scenarios:
  - name: Ping Stress (/ping)
    flow:
      - get:
          url: '/ping'