perf/ping/spike.yaml
config:
    environments:
      node:
        target: 'http://localhost:5555/node'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
  
    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  
    phases:
      - name: Constante
        duration: 20
        arrivalRate: 200

      - name: Pico
        duration: 10
        arrivalRate: 350

      - name: Constante
        duration: 20
        arrivalRate: 200

      - name: Pico
        duration: 10
        arrivalRate: 400

scenarios:
  - name: Ping Stress (/ping)
    flow:
      - get:
          url: '/ping'